Autodesk.Navisworks.Api.FileReferenceResolver
Utility class used to resolve a file reference to a real file

Autodesk.Navisworks.Api.FileReferenceResolver.#ctor
Default constructor

Autodesk.Navisworks.Api.FileReferenceResolver.InteractiveDisplayString
String to display to end user if reference has to be resolved interactively
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.FileReferenceResolver.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.FileReferenceResolver.ReferringFileName
File name that is referring to file to be resolved, empty if not known
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.FileReferenceResolver.ReferringFileNameAsSaved
File name that is referring to file to be resolved as it was when saved, empty if not known
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.FileReferenceResolver.Resolve(System.String)
Resolve a file reference (absolute path, relative path, URL, ...)

Autodesk.Navisworks.Api.FileReferenceResolver.Resolve(System.String,System.Boolean)
Resolve a file reference (absolute path, relative path, URL, ...)
resolveToOpen: Specify whether result should include FileNameToOpen